IDEA Open Model
RebarStirrups.Patterns Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the pattern of the rebar grouping. Holds distance between rebars/stirrups and length
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public List<RebarStirrupPattern> Patterns { get; set; }
Public Property Patterns As List(Of RebarStirrupPattern)
	Get
	Set
Property Value
Type: List<RebarStirrupPattern>
See Also
Reference
RebarStirrups Class
IdeaRS.OpenModel.Model Namespace